; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-5)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left ball1 ball2 ball3 ball4 ball5 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(free left)
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 room4)
(at ball5 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 room3)
(at ball5 room3)
)
)
)

; plan
1. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 3 of 5
2. (pick ball5 room4 left)
   deleted: (at ball5 room4) (free left)
   added: (carry ball5 left)
   goals met: 3 of 5
3. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 3 of 5
4. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 4 of 5
5. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 4 of 5
6. (pick ball4 room4 left)
   deleted: (at ball4 room4) (free left)
   added: (carry ball4 left)
   goals met: 4 of 5
7. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 4 of 5
8. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 5 of 5
